//problems.js
const getStatus = require("../../component/api_config.js").get_status_config; // 获取诉求提交状态
const imgApi = require("../../component/api_config.js").img_config; // 图片请求地址
//获取应用实例
const app = getApp()

Page({
  data: {
    imgUrl: imgApi,
    winWidth: 0,
    winHeight: 0,
    newsList: [
      {
        title: '大陆居民和台湾居民在大陆办理结婚登记时,应提交哪些材料？',
        texts: '答:大陆居民和台湾居民在大陆办理结婚登记应提交的材料有:',
        date: '2016-01-26',
        ptype: "1", // 结婚
        ptext: "结婚",
        id: '01'
      },
      {
        title: '在大陆办理结婚登记后，双方当事人如何向台湾户政部门申登结婚事项？',
        texts: '在大陆办理完结婚登记，当事人应将结婚公证书经海基会验证后，连同大陆配偶的大陆居民身份证复印件和保证书，到台湾移民事务主管部门办理查核。台湾配偶到台移民事务主管部门申请大陆配偶团聚(须接受访谈)...',
        date: '2015-06-01',
        ptype: "1", // 结婚
        ptext: "结婚",
        id: '02'
      },
      {
        title: '结婚前怀孕、在大陆出生的子女如何申请在台湾入户籍？',
        texts: '答：（1）先在大陆涉台公证处办理子女出生公证书、女方婚姻登记录证明公证书，公证书正本经海基会验证后，连同在台DNA鉴定具结书（入台再检验）及在台健康检查具结书（表格向台移民事务主管部门索取...',
        date: '2015-06-01',
        ptype: "2", // 在台定居
        ptext: "在台定居",
        id: '03'
      },
      {
        title: '大陆配偶是否可以在台湾就业？',
        texts: '答：2009年6月，台湾取消了大陆配偶赴台后6年内不能工作的限制，大陆配偶赴台后于依亲居留、长期居留期间或已经许可定居可以在台就业。',
        date: '2015-06-01',
        ptype: "2", // 在台定居
        ptext: "在台定居",
        id: '04'
      },
      {
        title: '大陆居民与台湾居民结婚后双方长期在大陆生活，是否可以在大陆生育二胎？',
        texts: '答：按大陆计划生育政策规定，大陆居民与台湾居民结婚后在大陆生育的，执行大陆居民一方户口所在地有关生育政策的规定。在适用生育政策时，若其所生育的子女均不在内地定居或长期居住，符合条件的，可按有关规定申请在大陆再生育。',
        date: '2015-06-01',
        ptype: "3", // 其他
        ptext: "其他",
        id: '05'
      },
      {
        title: '大陆配偶在台如遇有就业歧视情形，可到哪里申诉？',
        texts: '大陆配偶如遇有就业歧视情形，可以到当地县市主管机关（劳工处或社会处、局）申诉。',
        date: '2012-10-11',
        ptype: "4", // 在台团聚
        ptext: "在台团聚",
        id: '06'
      },
      {
        title: '在台长期居留大陆配偶是否可以在台湾参加职业训练？',
        texts: '大陆配偶在台湾参加职业训练，有以下几种情况：',
        date: '2012-10-09',
        ptype: "5", // 在台长期居留
        ptext: "在台长期居留",
        id: '07'
      },
      {
        title: '台湾配偶是否可以在大陆就业?',
        texts: '近年来，大陆不断采取措施方便台胞在大陆就业，拓宽其在大陆就业途径。',
        date: '2012-09-25',
        ptype: "3", // 其他
        ptext: "其他",
        id: '08'
      },
      {
        title: '大陆配偶是否可以在台湾就学?',
        texts: '大陆配偶在台湾依亲居留或长期居留期间，可依《补习及进修教育法》，进入补习及进修学校就读取得正式学籍(历)，还可依《自学进修学力鉴定考试办法》，参加自修学力鉴定考试。',
        date: '2012-09-24',
        ptype: "6", // 在台依亲居留
        ptext: "在台依亲居留",
        id: '09'
      },
      {
        title: '台胞子女是否可以在大陆中小学和幼儿园就读？',
        texts: '对台胞子女在大陆中小学和幼儿园就读，大陆实行“欢迎就读、一视同仁、就近入学、适当照顾”的政策，凡经批准设立的公办和民办普通中小学、幼儿园及中等职业教育机构都可以接受台胞子女就读。',
        date: '2012-09-21',
        ptype: "3", 
        ptext: "其他",
        id: '10'
      },
      {
        title: '大陆是否认可台湾高校学历？',
        texts: '2006年4月，教育部宣布承认经台湾教育行政部门核准的台湾高等学校学历，进一步方便广大台胞在大陆就学就业。',
        date: '2012-09-20',
        ptype: "3", 
        ptext: "其他",
        id: '11'
      },
      {
        title: '大陆出台了哪些有利于台胞在大陆就学的政策?',
        texts: '近年来，教育部采取了一系列措施，为台胞在大陆求学创造了更好的条件，如取消台湾学生报考年龄的限制，不再规定台湾学生录取分数线，分数线由各招生学校自定，并出台多项有利于台胞到大陆就学的政策。',
        date: '2012-09-18',
        ptype: "3", 
        ptext: "其他",
        id: '12'
      }
    ]
  },
  //事件处理函数
  butonHref: function (e) {
    console.log(e)
    console.log(e.currentTarget.dataset.id)
    let id = e.currentTarget.dataset.id
    wx.navigateTo({
      url: '../probdetail/probdetail?id=' + id
    })
  },
  onLoad: function () {
    var that = this;
    wx.setNavigationBarTitle({
      title: '常见问题'//修改顶部标题的内容
    })

    /** 
     * 获取系统信息 
     */
    wx.getSystemInfo({
      success: function (res) {
        // console.log(res)
        that.setData({
          winWidth: res.windowWidth,
          winHeight: res.windowHeight
        });
      }

    });
  }
})
